test/good/inheritance-state-mutation.cfg.dot
digraph "inheritance-state-mutation" {
    node [shape=box];
    subgraph "cluster_C__init_1766" {
        label="C__init_1766";
        "C__init_1766_68" [label="self.m = m"];
        "C__init_1766_69" [label="self.a = a",style=filled,fillcolor="#66A7DB"];
        "C__init_1766_68" -> "C__init_1766_69";
    }
    subgraph "cluster_C__updateBalance" {
        label="C__updateBalance";
        "C__updateBalance_70" [label="self.balance = 100"];
        "C__updateBalance_71" [label="self.balance -= 100"];
        "C__updateBalance_72" [label="self.m.set(3, 3)"];
        "C__updateBalance_73" [label="self.m.del(3)"];
        "C__updateBalance_74" [label="self.a.x = 42"];
        "C__updateBalance_75" [label="self.a.x += 42"];
        "C__updateBalance_76" [label="self.a.m.set(3, 3)"];
        "C__updateBalance_77" [label="self.a.m.del(3)",style=filled,fillcolor="#66A7DB"];
        "C__updateBalance_70" -> "C__updateBalance_71";
        "C__updateBalance_71" -> "C__updateBalance_72";
        "C__updateBalance_72" -> "C__updateBalance_73";
        "C__updateBalance_73" -> "C__updateBalance_74";
        "C__updateBalance_74" -> "C__updateBalance_75";
        "C__updateBalance_75" -> "C__updateBalance_76";
        "C__updateBalance_76" -> "C__updateBalance_77";
    }
    subgraph "cluster_V__updateBalance" {
        label="V__updateBalance";
        "V__updateBalance_78" [label="self.setBalance(100)",style=filled,fillcolor="#66A7DB"];
    }
}
