test/good/inheritance-state-mutation.cfg.mmd
graph TD
subgraph C__init_1766
    C__init_1766_143["self.m = m"]
    C__init_1766_144["self.a = a"]:::exitNode
    C__init_1766_143 --> C__init_1766_144
end
subgraph C__updateBalance
    C__updateBalance_146["self.balance = 100"]
    C__updateBalance_147["self.balance -= 100"]
    C__updateBalance_149["self.m.set(3, 3)"]
    C__updateBalance_151["self.m.del(3)"]
    C__updateBalance_153["self.a.x = 42"]
    C__updateBalance_155["self.a.x += 42"]
    C__updateBalance_157["self.a.m.set(3, 3)"]
    C__updateBalance_159["self.a.m.del(3)"]:::exitNode
    C__updateBalance_146 --> C__updateBalance_147
    C__updateBalance_147 --> C__updateBalance_149
    C__updateBalance_149 --> C__updateBalance_151
    C__updateBalance_151 --> C__updateBalance_153
    C__updateBalance_153 --> C__updateBalance_155
    C__updateBalance_155 --> C__updateBalance_157
    C__updateBalance_157 --> C__updateBalance_159
end
subgraph V__updateBalance
    V__updateBalance_162["self.setBalance(100)"]:::exitNode
end
